package ru.sklad;

public class Матиматические_действия {
    public static void main(String[] args) {
        float a, b, c;
        a = 23.678f;
        b = 369.5687f;
        c = 56.8f;
        //c = a+b; - сумма;
        //c = a-b; - вычитание;
        //c = a/b; - деление;
        //c = a*b; - умножение;
        //c += 45; - прибавить данное число к "с";
        //c -= 9;  - отнять данное число от "с"
        //c *= 5;  - умножить данное число на "с"
        //c /= 7;  - разделить "с" на данное число;
        //c++;     - прибавить 1 к "с";
        c--;     //- отнять 1 от "с".

        System.out.println(c);
    }
}
