package RegEx;/*RegEx_3! Регулярные выражения представляют мощный
* инструмент для обработки строк, который может использоваться в
* дополнение к методам класса String. В java функциональность
* регулярных выражений сосредоточена в пакете java.util.regex.
* Само регулярное выражение представляет шаблон для поиска совпадений
* в строке. Для задания подобного шаблона и поиска подстрок в строке,
* которые удовлетворяют данному шаблону, в Java определены классы
* Pattern и Matcher.*/

public class RegEx_1 {
}/*Регулярные выражения очень полезная вещь. Например у нас есть
1000 страниц с опечаткой одной буквы, и мы можем написать регулярку
котороая заменит эту букву на правельную!*/
