public class Условие {
    /*Необходимо применить все полученные ранее знания.
    Использовать все преметивы (8 штук), использовать циклы for и while.
    Использовать массивы и использовать наследование класса, инткапсуляцию, полиморфизм.
    Создать пакет и применить из него информацию в др классах.
     */

    /*Задача. У мужчины 2 дочки, 1 сын, жена, у 1й дочки сын и муж, у 2й дочки только муж, его сын еще подросток.
    Необходимо посчитать всех членов семьи и присвоить каждому имя и возраст.
    У мужчины есть автомобиль, присвоить ему название, цвет и скорость.
    Купить автомобиль для жены и использовать часть параметров автомобиля мужа.
    Доказать что у 1й дочки сын.
    Муж за рабочий день тратит на бензин в среднем 105 руб, построить массив на 31 день и разместить в буднии дни
    цену на бензин 1 число понедельник.
     */

}
