package Октябрь_25;

public class Операторы {
    /*== - оператор сравнения, равно; если оператор сравнивает объекты, то он смотрит на ячейку памяти;
    * != - оператор сравнения, не равно;
    * instanceof - оператор который смотрит является ли объект наследником какого-либо класса или экземпляра;
    * String + - оператор позволяющий преобразовывать значения String, например:
    *                     String s = "Hello";
                          System.out.println(s + " World!");
                          Ответ: Hello World!
    * При этом, если мы выведем System.out.println(5+6+""), то получим 11, т.к. 5 и 6 идут в переди стрингового
    * значения и являются цифрами; а если System.out.println(""+5+6), то получим 56, т.к String приобразовал 5 в
    * стринговое значение и мы получили текст + цифра.
    * ++ - инкремента, если сначало написать значение, а потом ++, то сначало произойдет расчет значений System и
    * только потом прибавится 1, если написать ++ перед значением, то сначало прибавится 1 а потом расчет System.
    * Пример 1:
    *   int a = 1;
        System.out.println(a++); //Ответ. 1
        System.out.println(a);   //Ответ. 2
      Пример 2:
        int a = 1;
        System.out.println(++a); //Ответ. 2
        System.out.println(a);   //Ответ. 2
     * ?: - условный оператор; этот опреатор производит проверку с помощью булеан и взависимости от "истина" "ложь",
     * оператор выбирает одно из двух заданных значений. Если "истина" возвращается 1е значение, "ложь" 2е.
     * Например:
     *  int a = (5>6)? 1:2;
        System.out.println(a);   //Ответ. 2
        int a = (5<6)? 1:2;
        System.out.println(a);   //Ответ. 1
        */
}

