package JDBC;
/*JDBC - это набор различных классов для работы с базой данных!
* Базы данных хранятся в виде таблиц, их множество. Есть язык
* запроса данных SQL.*/
public class JDBC_1 {
/*JDBC(Java DataBase Connectivity) - это платформенно-независимая технология,
* позволяющая из программы на Javaполучить доступ к любой SQL-совместимой базе данных.
* JDBC построен по драйверной архитектуре, типичной для универсальных систем доступа к
* данным.
* В настоящий момент действует стандарт JDBC 3.0. Главное достоинство JDBC — тесное
* взаимодействие с другими Java-технологиями в рамках создания распределенных
* систем. В первую очередь это касается JNDI (Java Naming and Directory
* Interface) и JTS (Java Transaction Service).
*
* Если говорить коротко, то JDBC позволяет делать три простые вещи:
    1. Установить соединение с базой данных.
    2. Посылать запросы и изменять состояние базы данных.
    3. Обрабатывать результаты запросов.
*/
}
