package JDBC;
/*MySql - свободная реляционная система управления
базами данных. Разработку и поддержку MySQL осуществляет корпорация
Oracle, получившая права на торговую марку вместе с поглощённой
Sun Microsystems, которая ранее приобрела шведскую компанию MySQL AB.
Продукт распространяется как под GNU General Public License, так
и под собственной коммерческой лицензией. Помимо этого, разработчики
создают функциональность по заказу лицензионных пользователей.
Именно благодаря такому заказу почти в самых ранних версиях
появился механизм репликации.*/

public class JDBC_2 {
    /*Регистрируемся на www.oracle.com. Далее переходим на оффициальный
    * сайт MySQL и качаем MySQL-instailer.*/
}
