package Ноябрь_27;

public class Java_Beans {
/*JavaBeans — классы в языке Java, написанные по определённым правилам.
Они используются для объединения нескольких объектов в один для удобной
передачи данных.
Спецификация Sun Microsystems определяет JavaBeans как повторно используемые
программные компоненты, которыми можно управлять, используя графические
конструкторы и средства IDE.
JavaBeans обеспечивают основу для многократно используемых, встраиваемых
и модульных компонентов ПО. Компоненты JavaBeans могут принимать различные
формы, но наиболее широко они применяются в элементах графического пользовательского
интерфейса. Одна из целей создания JavaBeans — взаимодействие с похожими компонентными
структурами. Например, Windows-программа, при наличии соответствующего моста или
объекта-обёртки, может использовать компонент JavaBeans так, будто бы он является
компонентом COM или ActiveX.*/
}
