package Best_practice.BestPractice_16_30;/*Почему нужно использовать @Override*/

public class BestPractice_20 {
    /*@Override помогает избежать ошибок в коде,
    * если мы например забыли в методе какие либо значения
    * исправить или дописать. Без него код может выглядеть правельным, но при этом
    * при компеляции, мы можем получить или ошибку или не правельный результат.
    *
    * @Override помогает нам избежать этого, указывая нам на ошибке в коде!
    * Есть одно исключение - это абстрактные классы, кторые на этапе наследования будут,
    * говорить нам о том что необходимо переопределить метод!*/

}
