package Swing;
/*Layout*/
/*Менеджер расположения (layout manager) определяет,
каким образом на форме будут располагаться компоненты.
Независимо от платформы, виртуальной машины, разрешения
и размеров экрана менеджер расположения гарантирует,
что компоненты будут иметь предпочтительный или
близкий к нему размер и располагаться в том порядке,
который был указан программистом при создании программы.*/

/*Для примера создаем GUI Form  и в нем эксперементируем.
* Для запуска нажимаем правую кнопку мыши и вы бираем
* Preview*/
public class Swing_16 {

}
