package Best_practice.BestPractice_1_15;
/*Ряд уроков на тему как правильно писать код!
* Есть фаил на http://www.oracle.com/technetwork/java/codeconventions-150003.pdf
* под названием Java Code Conventions в котором изложены все правила написания
* правильного кода!!!
*
* Далее в уроках будут рассмотрены примеры и пояснения почему, напрмер, переменные
* нужно указывать private. На каждом уроки мы не будем следовать всем правилам, а только
* тем которые рассматриваем в рамках данного урока!*/

public class BestPractice_1 {
}
