package Best_practice.BestPractice_1_15;/*Не используйте row типы*/

public class BestPractice_15 {
    public static void main(String[] args) {
        /*
         * Начиная с 5й java у нас появилсиь джененрики. Позволяющие нам ограничить
         * добавления элементов, кроме тех котрые были указаны. Лучше всегда использовать
         * новые дженнерики, от старых лучше отказаться вовсе.
         * Дженерики у нас есть только на этапе компиляции, после они пропадают.
         *
         */
    }
}
