public class Type {
    public static void main(String[] args) {
        /*Базовые типы данных!*/
    byte a = 1;       //размер 1 байт, диапазон значений целые числа [-128; 127]
    short b = 1;      //размер 2 байта, целые числа [-32768; 32767]
    int c = 1;        //размер 4 байта, целые числа [-2147483648; 2147483647]
    long d = 1;       //размер 8 байт, [-9223372036854775808; 9223372036854775808]
    float e = 1.4f;   //размер 4 байта, [3.4е-45...3.4е+38]
    double r = 1.5;   //размер 8 байт, [4,9е-324...1,8е+308]
    char t = 0;       //размер 2 байта, натуральные из [0; 65535]
    boolean y = false;//размер выделяется по разному, false либо true (лож либо истина)
    }
}
