package com.two;
       //Дан трактор до максимальной скорости 100км.ч разгон 40 сек., за сколько он разгонится до 50 км.час?
public class Two {
    public void traktor() {
        System.out.print("Трактор разгоняется за "); }
        int t = 40;
        int t1 = 100;
        int t2 = 50;
        int t3 = (t*t2)/t1;
        double ty()
        {return t3;}
}


